title: Abusing impersonation. Service account –> SYSTEM
description: Detection of processes spawned under SYSTEM by processes started with Network or Local service accounts
references:
    - https://www.slideshare.net/heirhabarov/hunting-for-privilege-escalation-in-windows-environment
tags:
    - attack.defense_evasion
    - attack.privilege_escalation
    - attack.t1134
status: experimental
author: Teymur Kheirkhabarov
logsource:
    product: windows
    service: sysmon
detection:
    selection1:
        EventID: 1
        User: "NT AUTHORITY\\SYSTEM"
        ParentUser: 
          - "NT AUTHORITY\\NETWORK SERVICE" 
          - "NT AUTHORITY\\LOCAL SERVICE"
    selection2:
        CommandLine: 
            - "*rundll32*"
    selection3:
        CommandLine: 
            - "*DavSetCookie*"            
    condition: selection1 and not (selection2 and selection3)
falsepositives: 
    - Todo
level: critical
enrichment:
    - EN_0001_cache_sysmon_event_id_1_info
    - EN_0002_enrich_sysmon_event_id_1_with_parent_info
