title: Token swapping using Mimikatz driver
description: Detection of child processes spawned under SYSTEM by process with High integrity level
references:
    - https://www.slideshare.net/heirhabarov/hunting-for-privilege-escalation-in-windows-environment
tags:
    - attack.defense_evasion
    - attack.privilege_escalation
    - attack.t1134
status: experimental
author: Teymur Kheirkhabarov
logsource:
    product: windows
    service: sysmon
detection:
    selection:
        EventID: 1
        ParentIntegrityLevel: High
        IntegrityLevel: System
        User: "NT AUTHORITY\\SYSTEM"
    condition: selection
falsepositives: 
    - Todo
level: critical
enrichment:
    - EN_0001_cache_sysmon_event_id_1_info
    - EN_0002_enrich_sysmon_event_id_1_with_parent_info
